-------------------------------------------------------------------------------------
      Layer (type)                      Output Shape         Param #     Tr. Param #
=====================================================================================
             GRU-1     [64, 1000, 128], [2, 64, 128]         173,568         173,568
          Linear-2                     [64, 1000, 3]             387             387
=====================================================================================
Total params: 173,955
Trainable params: 173,955
Non-trainable params: 0